ch2i/ch2i-arduino-boards/avr/boards.txt

menu.cpu=Processor
menu.clock=Clock
menu.upload=Upload Speed

######################################################
#            Optiboot 8MHz/16Mhz 250Kb/1Mb           #
#    bootloader for  ATMega1284p running up 1MBPS    #
######################################################

atmega1284p.name=Arduino Mega (ATmega1284p)

atmega1284p.menu.clock.8MHz=8 MHz
atmega1284p.menu.clock.8MHz.build.f_cpu=8000000L
atmega1284p.menu.clock.16MHz=16 MHz
atmega1284p.menu.clock.16MHz.build.f_cpu=16000000L

atmega1284p.menu.upload.250K=250 KBps
atmega1284p.menu.upload.250K.upload.speed=250000
atmega1284p.menu.upload.1M=1 MBps
atmega1284p.menu.upload.1M.upload.speed=1000000

atmega1284p.upload.tool=arduino:avrdude
atmega1284p.upload.protocol=arduino
atmega1284p.upload.maximum_size=130048
atmega1284p.upload.maximum_data_size=16384

atmega1284p.build.mcu=atmega1284p
atmega1284p.build.core=arduino:arduino
atmega1284p.build.board=AVR_MEGA_1284P
atmega1284p.build.variant=mega1284p

atmega1284p.bootloader.low_fuses=0xFF
atmega1284p.bootloader.high_fuses=0xD6
atmega1284p.bootloader.extended_fuses=0xFF
atmega1284p.bootloader.path=optiboot
atmega1284p.bootloader.unlock_bits=0x3F
atmega1284p.bootloader.lock_bits=0x0F
atmega1284p.bootloader.tool=arduino:avrdude
atmega1284p.bootloader.file=mega1284p/optiboot_flash_{build.mcu}_{build.f_cpu}_{upload.speed}Bps.hex

#####################################################
#           Optiboot 8MHz/16Mhz 250Kb/1Mb           #
#    bootloader for  ATMega328p running up 1MBPS    #
#####################################################

atmega328p_minilora.name=Mini Lora (ATmega328p)

atmega328p_minilora.menu.clock.8MHz=8 MHz
atmega328p_minilora.menu.clock.8MHz.build.f_cpu=8000000L
atmega328p_minilora.menu.clock.16MHz=16 MHz
atmega328p_minilora.menu.clock.16MHz.build.f_cpu=16000000L
atmega328p_minilora.menu.clock.16MHzAt8MHz=8MHz (Crystal 16MHz)
atmega328p_minilora.menu.clock.16MHzAt8MHz.build.f_cpu=8000000L
atmega328p_minilora.menu.clock.16MHzAt8MHz.build.extra_flags=-DCLOCK_DIV_2

atmega328p_minilora.menu.upload.250K=250 KBps
atmega328p_minilora.menu.upload.250K.upload.speed=250000
atmega328p_minilora.menu.upload.1M=1 MBps
atmega328p_minilora.menu.upload.1M.upload.speed=1000000
atmega328p_minilora.menu.upload.115K=115200 Bps
atmega328p_minilora.menu.upload.115K.upload.speed=115200
atmega328p_minilora.menu.upload.57K=57600 Bps
atmega328p_minilora.menu.upload.57K.upload.speed=57600

atmega328p_minilora.upload.tool=arduino:avrdude
atmega328p_minilora.upload.protocol=arduino
atmega328p_minilora.upload.maximum_size=32256
atmega328p_minilora.upload.maximum_data_size=2048

atmega328p_minilora.build.mcu=atmega328p
atmega328p_minilora.build.core=arduino:arduino
atmega328p_minilora.build.board=AVR_MINILORA
atmega328p_minilora.build.variant=minilora

atmega328p_minilora.bootloader.low_fuses=0xFF
atmega328p_minilora.bootloader.high_fuses=0xde
atmega328p_minilora.bootloader.extended_fuses=0x06
atmega328p_minilora.bootloader.path=optiboot
atmega328p_minilora.bootloader.unlock_bits=0x3F
atmega328p_minilora.bootloader.lock_bits=0xcF
atmega328p_minilora.bootloader.tool=arduino:avrdude
atmega328p_minilora.bootloader.file=minilora/optiboot_flash_{build.mcu}_{upload.speed}Bps_{build.f_cpu}.hex

#####################################################
#            loraduino 3V3 8MHz 57600               #
#   bootloader arduino pro mini  running up 57600   #
#####################################################

atmega328p_loraduino.name=Loraduino (ATmega328p)

atmega328p_loraduino.menu.clock.8MHz=8 MHz
atmega328p_loraduino.menu.clock.8MHz.build.f_cpu=8000000L

atmega328p_loraduino.menu.upload.115K=115200 Bps
atmega328p_loraduino.menu.upload.115K.upload.speed=115200
atmega328p_loraduino.menu.upload.57K=57600 Bps
atmega328p_loraduino.menu.upload.57K.upload.speed=57600

atmega328p_loraduino.upload.tool=arduino:avrdude
atmega328p_loraduino.upload.protocol=arduino
atmega328p_loraduino.upload.maximum_size=30720
atmega328p_loraduino.upload.maximum_data_size=2048

atmega328p_loraduino.build.mcu=atmega328p
atmega328p_loraduino.build.core=arduino:arduino
atmega328p_loraduino.build.board=AVR_LORADUINO
atmega328p_loraduino.build.variant=loraduino

atmega328p_loraduino.bootloader.low_fuses=0xFF
atmega328p_loraduino.bootloader.high_fuses=0xDA
atmega328p_loraduino.bootloader.extended_fuses=0xFD
atmega328p_loraduino.bootloader.path=optiboot
atmega328p_loraduino.bootloader.unlock_bits=0x3F
atmega328p_loraduino.bootloader.lock_bits=0xcF
atmega328p_loraduino.bootloader.tool=arduino:avrdude
atmega328p_loraduino.bootloader.file=atmega/ATmegaBOOT_168_atmega328_pro_8MHz.hex

